from .. import Provider as FloraProvider


class Provider(FloraProvider):

    plant_names = (
        "Αγγούρια",
        "Αγκινάρες",
        "Αρακάς",
        "Καρότα",
        "Κολοκυθάκια - Κολοκύθια",
        "Κουκιά",
        "Κουνουπίδια",
        "Κρεμμύδια",
        "Λάχανα",
        "Μαρούλια",
        "Μελιτζάνες",
        "Μπάμιες",
        "Μπρόκολα",
        "Ντομάτες",
        "Παντζάρια",
        "Πατάτες",
        "Πιπεριές",
        "Πράσα",
        "Ραπανάκια",
        "Σκόρδα",
        "Σπανάκι",
        "Φασολάκια",
        "Αμαρύλλις",
        "Αστήρ",
        "Καμπανούλα",
        "Ανεμώνη",
        "Περγαμότο",
        "Χρυσάνθεμο",
        "Μαργαρίτα",
        "Τριφύλλι",
        "Ασφόδελο",
        "Κρόκος",
        "Γαρύφαλλο",
        "Ηελοχάρης",
        "Δακτυλίς",
        "Υάκινθος",
        "Πρίνος",
        "Ίρις",
        "Κρίνος",
        "Πασχαλιά",
        "Λεβάντα",
        "Μαντζουράνα",
        "Ορχιδέα",
        "Μιμόζα",
        "Ηράνθεμο",
        "Δενδρολίβανο",
        "Τριαντάφυλλο",
        "Πετούνια",
        "Παιωνία",
        "Φασκόμηλο",
        "Θυμάρι",
        "Αντίρριο",
        "Γαϊδουράγκαθο",
        "Ηλιοτρόπιο",
        "Θηρανθεμίς",
        "Τουλίπα",
        "Ζίννια",
        "Μπιγκόνια",
    )

    def plant_name(self) -> str:
        """
        Return greek plant name randomly
        example: 'Αγκινάρες'
        """
        return self.random_element(self.plant_names)
